# Instructions:

Dear class. Here is the practice mock exam. Please time yourselves IF you wish. It is better to do so. Tell me how much time it took you. 
We will go through this in class. 
In the practice notebook, answer the questions in the same line that says #Answer here.' This way, you can see the questions' output and continue to work on your answer until you get the right answer. 
You can add cells to the notebook to help you BUT make sure you always put here is my answer in a cell. So we know.
I will hand out the solutions on Tues so you can study more. But for now I want you to try.
Good Luck!

### Import neccessary libraries:

In [1]:
#Answer Here pd,np plt magic inline

In [1]:
import pandas as pd
import os
import sys
import numpy as np
import matplotlib as plt
%matplotlib inline

### Load the dataset  'titanic.xls' . Use the pd.read_xls() DataFrame read function. Call the dataframe df_T1 or Titanic1 because there will be another titanic data set we will use as well

In [2]:
#Answer Here Make sure all of your files including the ipynb are in the correct Downloads directory

In [3]:
Titanic1 = pd.read_excel('titanic.xls')

### Show the head of the dataframe and briefly explain the data

In [3]:
#Answer Here

In [6]:
Titanic1.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Return some info on the data and briefly explain what the categories mean

In [4]:
#Answer here

### 'Describe' the main statistical features of the data. For example, what is the median value of a numeric age or fare? Pick a column and explain what the medium means.

In [5]:
#Answer here

In [7]:
Titanic1.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1301.000000,1301.000000,1040.000000,1301.000000,1301.000000,1300.000000,118.000000
mean,2.290546,0.384320,29.902083,0.499616,0.387394,33.427608,156.898305
std,0.838577,0.486621,14.430969,1.044123,0.867691,51.890374,95.731229
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,70.500000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.456250,151.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,248.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,327.000000

### Include 50% to 100% percentile with 5% increments for the 'age' column in the describe method output

In [6]:
#Answer here remeber the ETL sheet last week.

### What is the 80% percentile of the 'age' column?

In [7]:
#Answer here

### Create a sub dataframe where the age of passengers is above the 80% percentile calculated above

In [8]:
#Answer here

### Count the number of passengers in first class

In [9]:
#Answer here

### Create a new column called 'older than 90% percentile' where it's true/false if the passenger is older/younger than the 90% percentile

In [10]:
#Answer here We did this in the ETL notebook

### Group the 'fare' column by the class of passenger and get the mean fare price for each class

In [11]:
#Answer here

### Plot the bar chart for the avg fare grouped by class

In [12]:
#Answer here rember that group has features like dataframe

### Replace outliers ( all values less than 5 % and greater then 95% above) in the dataframe by the mean of the 'fare' column You may wish to copy() the dataframe before doing so into another dataframe.

In [13]:
#Answer here You MAY get a warning about slicing and using loc as  the prefered methon

### Replace outliers in the dataframe by the mean of the 'fare' column

In [14]:
#Answer here

### Load the contents of 'titanic2.csv', look at the head of the data for its structure and combine it with the previous dataframe. What is the best way to combine is it concat or merge?

In [15]:
#Answer here

In [16]:
#Anaswer here

### How many rows does df2 have ?

In [ ]:
#Ans here

### Plot a scatter plot of 'age' vs 'fare' for your combined data and calculate the correlation between these two columns. Use the corr() function we discussed in last notebook.

In [17]:
#Answer here

In [18]:
#Answer here

### Drop 'name', 'cabin', 'boat', 'body','home.dest', 'embarked', 'ticket' columns fro the combined dataframe

In [19]:
#Answer here

# Filling missing data in 'age' column by using an apply and your own function:

### Write a function that takes two columns, 'age' and 'pclass', as input and depending on which pclass, if the age is NaN (command: pd.isnull(age)   ) it returns age 40, 30 or 25. For example, if input is [NaN, 1], it returns age = 40

In [20]:
#Answer here

### Use apply to clean up age database for NaN using the function created above

In [21]:
#Answer here

### In the 'fare' column, isolate and display the row where there is NaN

In [22]:
#Answer here use info to see if you have any Nans.

### Using apply fuction, convert the data in 'sex' column to zeros and ones: if female, replace by 1, otherwise by 0

In [23]:
#Answer here

### Display the top rows for 'sex' column

In [24]:
#Answer here

### Confirm that the contents of the 'sex' column are integers by showing the type of one content (zero's index, first, etc) or using the info command

In [25]:
#Answer here

### In 'fare' column, replace NaN with the mean of the column

In [26]:
#Answer here

### Drop any leftover NaN in the dataframe

In [27]:
#Answer here

### Display the head of cleaned dataframe

In [28]:
#Answer here

# Merge and Concat Practice:

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2'],
                        'C': ['C0', 'C1', 'C2'],
                        'D': ['D0', 'D1', 'D2']},
                        index=[0, 1, 2])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6'],
                        'B': ['B4', 'B5', 'B6'],
                        'C': ['C4', 'C5', 'C6'],
                        'D': ['D4', 'D5', 'D6']},
                         index=[0, 1, 2])

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10'],
                        'B': ['B8', 'B9', 'B10'],
                        'C': ['C8', 'C9', 'C10'],
                        'D': ['D8', 'D9', 'D10']},
                        index=[0, 1, 2])

### Concat the dataframes above

In [ ]:
#Answer here

### Concat the three dataframes on columns

In [ ]:
#Answer here

### Add 'key' column to both df1 and df2 as ['a','b','c'] and merge df1 and df2 on the shared key

In [ ]:
#Answer here

### Concat df1 and df3 (pay attention to the NaN data)

In [ ]:
#Answer here try axis 1 and 0

# Extra data analysis examples FOR PRACTICE: 
#### Although the final answer is mostly one line, the process and the final answer can be broken down into several lines.

### Load the dataframe in 'http://www.fdic.gov/bank/individual/failed/banklist.html'. The result is a list and its zero index is the dataframe we want. Display the head of the data, info, and describe and explain the structure of the data briefly.

In [ ]:
#Answer here

In [ ]:
#Answer here

In [ ]:
#Answer here

In [ ]:
#Answer here

### What are the top 3 acquiring institutions?

In [ ]:
#Answer here

### How many city names start with the letter 'A'  and how many don't?

In [ ]:
#Answer here

### What are the cities whose names consist of 2 words and how many are there?

In [ ]:
#Answer here

# QED!